pista86/CESE-6Co2018---PCSE-/Codigo uso QSPI para EMW3166/43xxx_Wi-Fi/WICED/platform/MCU/PSoC6/peripherals/spi_flash/spi_flash.c
/*
 * Copyright 2018, Cypress Semiconductor Corporation or a subsidiary of 
 * Cypress Semiconductor Corporation. All Rights Reserved.
 * 
 * This software, associated documentation and materials ("Software"),
 * is owned by Cypress Semiconductor Corporation
 * or one of its subsidiaries ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products. Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

#include "spi_flash.h"
#include <string.h> /* for NULL */
#include <stdio.h> /* for printf */
#include "wwd_constants.h"
#include "platform_constants.h"
#include "platform_config.h"
#include "platform_peripheral.h"
#include "platform_mcu_peripheral.h"
#include "platform_isr.h"
#include "platform_isr_interface.h"
#include "wwd_rtos_isr.h"
#include "wiced_defaults.h"
#include "wiced_framework.h"


/* PSoC6 Kit specific External Memory configuration needed by PDL */
#include "cy_smif_memconfig.h"

#define SMIF_1_DESELECT_DELAY          ( 7u )      /* Minimum duration of SPI de-selection */
#define ADDRESS_SIZE                   ( 3u )      /* Memory address size */
#define PACKET_SIZE                    ( 256u )    /* The Memory Write packet */

/* PSoC6 Pins used for SMIF Interface */
#define PSOC_SMIF_PORT                 ( 11u )     /* Port for Quad SPI Interface Pins */
#define PSOC_SMIF_SPI_SELECT0          ( 2u )      /* Pin2 - Select0 */
#define PSOC_SMIF_SPI_DATA3            ( 3u )      /* Pin3 - Data3 */
#define PSOC_SMIF_SPI_DATA2            ( 4u )      /* Pin4 - Data2 */
#define PSOC_SMIF_SPI_DATA1            ( 5u )      /* Pin5 - Data1 */
#define PSOC_SMIF_SPI_DATA0            ( 6u )      /* Pin6 - Data0 */
#define PSOC_SMIF_SPI_CLK              ( 7u )      /* Pin7 - Clock */

#define SECTOR_SIZE_16_MEG             ( 16 * 1024 * 1024 ) /* Max SPI Flash access with 3 byte address */

#define MAX_WRITE_SIZE                 ( 0x100 )   /* PDL Max Write size */

#define MAX_DISPLAY                    ( 0x20 )    /* Data display count */

// #define PRINT_DEBUG
#ifdef PRINT_DEBUG
#if !defined ( BOOTLOADER )
#define DEBUG_PRINTS(a) printf a
#else /* !defined ( BOOTLOADER ) */
#define DEBUG_PRINTS(a)
#endif /* !defined ( BOOTLOADER ) */
#else /* PRINT_DEBUG */
#define DEBUG_PRINTS(a)
#endif /* PRINT_DEBUG */

// #define PRINT_DEBUG_CRIT
#ifdef PRINT_DEBUG_CRIT
#if !defined ( BOOTLOADER )
#define DEBUG_PRINTS_CRIT(a) printf a
#else /* !defined ( BOOTLOADER ) */
#define DEBUG_PRINTS_CRIT(a)
#endif /* !defined ( BOOTLOADER ) */
#else /* PRINT_DEBUG_CRIT */
#define DEBUG_PRINTS_CRIT(a)
#endif /* PRINT_DEBUG_CRIT */



/* Static Global variables */
static cy_stc_smif_context_t smif_block_context;
static uint32_t erase_sector_size;
static uint32_t mask_address_in_sector;
static uint32_t backup_sector_address;
static uint32_t memory_size;

static
void platform_address_to_pdl_array( uint32_t address, uint8_t pdl_addr_arr[] )
{
    pdl_addr_arr[2] = (uint8_t) ( address & 0xff );
    pdl_addr_arr[1] = (uint8_t) ( ( address & 0xff00 ) >> 8 );
    pdl_addr_arr[0] = (uint8_t) ( ( address & 0xff0000 ) >> 16 );
}

static
void RxCmpltCallback ( uint32_t event )
{
    if( 0u == event )
    {
        /*The process event is 0*/
    }
}

static
void platform_print_read_data( uint8_t * rx_buffer, uint32_t size )
{
    uint32_t index;

    UNUSED_PARAMETER( rx_buffer );
    DEBUG_PRINTS( ( "platform_print_read_data: \r\n" ) );

    for( index=0; index<size; index++ )
    {
       DEBUG_PRINTS( ( "0x%02X ", (unsigned int) rx_buffer[index] ) );
       if ( index >= MAX_DISPLAY )
       {
           break;
       }
    }

    DEBUG_PRINTS( ( "\r\n" ) );
    DEBUG_PRINTS( ( "=======================\r\n" ) );
}

static
void platform_print_write_data( uint8_t * tx_buffer, uint32_t size )
{
    uint32_t index;

    UNUSED_PARAMETER( tx_buffer );

    DEBUG_PRINTS( ( "Written Data: \r\n" ) );

    for( index=0; index<size; index++ )
    {
       DEBUG_PRINTS( ( "0x%02X ", (unsigned int) tx_buffer[index] ) );
       if ( index >= MAX_DISPLAY )
       {
           break;
       }
    }
    DEBUG_PRINTS( ( "\r\n" ) );
}

static
void platform_read_memory( uint8_t rx_buffer[],
                           uint32_t rx_size,
                           uint32_t address,
                           uint32_t print_true )
{
    cy_en_smif_status_t smif_status;
    cy_stc_smif_mem_device_cfg_t *device = smifMemConfigs[0]->deviceCfg;
    uint8_t rx_buffer_reg;
    cy_stc_smif_mem_cmd_t *cmdreadStsRegQe = device->readStsRegQeCmd;
    SMIF_Type *baseaddr = SMIF0;
    cy_stc_smif_context_t *smif_context = &smif_block_context;
    uint8_t ext_mem_address[3];

    (void) platform_watchdog_kick();

    if ( print_true )
    {
        DEBUG_PRINTS( ( "Entered %s\r\n", __func__ ) );
        DEBUG_PRINTS( ( "\r\n%s: Address: 0x%04lX, Size: %lu\r\n\r\n", __func__, address, rx_size ) );
    }

    /* Set QE */
    smif_status = Cy_SMIF_Memslot_QuadEnable( baseaddr, (cy_stc_smif_mem_config_t*)smifMemConfigs[0], smif_context );
    if( smif_status != CY_SMIF_SUCCESS )
    {
          DEBUG_PRINTS( ( "Cy_SMIF_Memslot_QuadEnable() Failed!! status: 0x%04X\r\n", smif_status ) );
          return;
    }

     /* Added to avoid delay and confirm the completion of previous API */
     while( Cy_SMIF_Memslot_IsBusy( baseaddr, ( cy_stc_smif_mem_config_t* )smifMemConfigs[0], smif_context ) )
         ;

    /* Read data from the external memory configuration register */
    smif_status = Cy_SMIF_Memslot_CmdReadSts( baseaddr, smifMemConfigs[0], &rx_buffer_reg, (uint8_t)cmdreadStsRegQe->command , smif_context );
    if( smif_status!=CY_SMIF_SUCCESS )
    {
        DEBUG_PRINTS( ( "Cy_SMIF_Memslot_CmdReadSts() Failed!! status: 0x%04X\r\n", smif_status ) );
        return;
    }

    DEBUG_PRINTS( ( "Received Data: 0x%X\r\n", (unsigned int) rx_buffer_reg ) );

    /* Added to avoid delay and confirm the completion of previous API */
    while( Cy_SMIF_Memslot_IsBusy( baseaddr, (cy_stc_smif_mem_config_t*)smifMemConfigs[0], smif_context ) )
        ;

    (void) platform_watchdog_kick();

    platform_address_to_pdl_array( address, ext_mem_address );
    /* The 4 Page program command */
    smif_status = Cy_SMIF_Memslot_CmdRead( baseaddr, smifMemConfigs[0], ext_mem_address, rx_buffer, rx_size, &RxCmpltCallback, smif_context );

    if( smif_status!=CY_SMIF_SUCCESS )
    {
        DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_CmdRead failed\r\n" ) );
        return;
    }

    while( Cy_SMIF_BusyCheck( baseaddr ) )
        ;


    /* Send received data to the console */
    if ( print_true )
    {
       platform_print_read_data( rx_buffer, rx_size );
    }

    (void) platform_watchdog_kick();
}

static
void platform_write_memory( uint8_t tx_buffer[], uint32_t tx_size, uint32_t address )
{
    cy_en_smif_status_t smif_status;
    uint8_t rx_buffer_reg;
    cy_stc_smif_mem_device_cfg_t *device = smifMemConfigs[0]->deviceCfg;
    cy_stc_smif_mem_cmd_t *cmdreadStsRegQe = device->readStsRegQeCmd;
    cy_stc_smif_mem_cmd_t *cmdreadStsRegWip = device->readStsRegWipCmd;
    uint8_t ext_mem_address[3];
    uint32_t completed_check_cnt = 0;
    uint32_t cur_addr;
    uint32_t cur_write_size;
    uint32_t size = tx_size;
    cy_stc_smif_context_t *smif_context = &smif_block_context;
    SMIF_Type *baseaddr = SMIF0;

    DEBUG_PRINTS( ( "Entered %s\r\n", __func__ ) );
    DEBUG_PRINTS( ( "\r\n%s: Address: 0x%04lX, Size: %lu\r\n\r\n", __func__, address, tx_size ) );

