pista86/CESE-6Co2018---PCSE-/Codigo uso QSPI para EMW3166/43xxx_Wi-Fi/WICED/platform/MCU/PSoC6/peripherals/spi_flash/spi_flash.c
    cur_addr = address;

    while ( completed_check_cnt < size )
    {

        (void) platform_watchdog_kick();

        /* Set QE */
        smif_status = Cy_SMIF_Memslot_QuadEnable( baseaddr, (cy_stc_smif_mem_config_t*)smifMemConfigs[0], smif_context );
        if(smif_status!=CY_SMIF_SUCCESS)
        {
            DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_QuadEnable failed\r\n" ) );
            return;
        }

        /* Added to avoid delay and confirm the completion of previous API */
        while( Cy_SMIF_Memslot_IsBusy( baseaddr, (cy_stc_smif_mem_config_t*)smifMemConfigs[0], smif_context ) );

        /* Read data from the external memory configuration register */
        smif_status = Cy_SMIF_Memslot_CmdReadSts( baseaddr, smifMemConfigs[0], &rx_buffer_reg, (uint8_t)cmdreadStsRegQe->command , smif_context );
        if( smif_status!=CY_SMIF_SUCCESS )
        {
            DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_CmdReadSts failed\r\n" ) );
            return;
        }

        /* Send Write Enable to external memory */
        smif_status = Cy_SMIF_Memslot_CmdWriteEnable( baseaddr, smifMemConfigs[0], smif_context );
        if( smif_status!=CY_SMIF_SUCCESS )
        {
            DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_CmdWriteEnable failed\r\n" ) );
            return;
        }

        platform_address_to_pdl_array( cur_addr, ext_mem_address );

        if ( ( size - completed_check_cnt ) > MAX_WRITE_SIZE )
        {
            cur_write_size = MAX_WRITE_SIZE;
        }
        else
        {
            cur_write_size = size - completed_check_cnt;
        }

        (void) platform_watchdog_kick();

        DEBUG_PRINTS( ( "\r\n%s, Address: 0x%08lX, Size: %lu, data_ptr: 0x%08lX\r\n\r\n", __func__, cur_addr, cur_write_size, (uint32_t) &tx_buffer[completed_check_cnt] ) );
        /* Quad Page Program command */
        smif_status = Cy_SMIF_Memslot_CmdProgram( baseaddr, smifMemConfigs[0], ext_mem_address, &tx_buffer[completed_check_cnt], cur_write_size, &RxCmpltCallback, smif_context );
        if( smif_status!=CY_SMIF_SUCCESS )
        {
            DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_CmdProgram failed\r\n" ) );
            return;
        }

        while( Cy_SMIF_Memslot_IsBusy(baseaddr, (cy_stc_smif_mem_config_t*)smifMemConfigs[0], smif_context ) )
        {
            /* Wait until the Erase operation is completed */
        }

        /* Read data from the external memory status register */
        smif_status = Cy_SMIF_Memslot_CmdReadSts( baseaddr, smifMemConfigs[0], &rx_buffer_reg,
                                            (uint8_t)cmdreadStsRegWip->command , smif_context );
        if( smif_status!=CY_SMIF_SUCCESS )
        {
            DEBUG_PRINTS( ( "\r\n\r\nSMIF ReadStatusReg failed\r\n" ) );
            return;
        }

        (void) platform_watchdog_kick();

        platform_print_write_data( &tx_buffer[completed_check_cnt], cur_write_size );

        completed_check_cnt += cur_write_size;
        cur_addr += cur_write_size;
    }
}




int sflash_read( const sflash_handle_t* const handle, unsigned long device_address, /*@out@*/ /*@dependent@*/ void* const data_addr, unsigned int size )
{
    UNUSED_PARAMETER( handle );

    DEBUG_PRINTS( ( "\r\n%s, Address: 0x%04lX, Size: %u\r\n\r\n", __func__, device_address, size ) );

    platform_read_memory( data_addr, size, device_address, 0 );

    return ( 0 );
}



int sflash_write( const sflash_handle_t* const handle, unsigned long device_address, /*@observer@*/ const void* const data_addr, unsigned int size )
{
    void *data = (void *) data_addr;

    UNUSED_PARAMETER( handle );

    DEBUG_PRINTS( ( "\r\n%s: Calling platform_print_read_data for display data to be written\r\n", __func__ ) );
    platform_print_read_data( (uint8_t *)data, (uint32_t)size );


    DEBUG_PRINTS( ( "\r\n%s: Address: 0x%04lX, Size: %u, data_ptr: 0x%08lX\r\n\r\n", __func__, device_address, size, (uint32_t) data ) );
    platform_write_memory( data, size, device_address );

    return ( 0 );
}

static
int platform_check_for_non_ff ( uint8_t *loc, uint32_t size )
{
    uint32_t i;

    for ( i = 0; i < size; i++ )
    {
        if ( loc[i] != 0xff )
        {
            return ( 1 );
        }
    }
    return ( 0 );
}

static
int sflash_need_to_erase ( unsigned long device_address, unsigned int size )
{
    uint8_t read_mem_buf[PACKET_SIZE];
    uint32_t completed_check_cnt = 0;
    uint32_t cur_addr = device_address;
    uint32_t cur_read_size;
    while ( completed_check_cnt < size )
    {

        if ( ( size - completed_check_cnt ) > PACKET_SIZE )
        {
            cur_read_size = PACKET_SIZE;
        }
        else
        {
            cur_read_size = size - completed_check_cnt;
        }

        platform_read_memory( read_mem_buf, cur_read_size, cur_addr, 0 );

        if ( platform_check_for_non_ff ( read_mem_buf, cur_read_size ) )
        {
             DEBUG_PRINTS(("\r\nNEED TO ERASE!!!!! %s: Address: 0x%04lX, Size: %u\r\n\r\n", __func__, device_address, size));
             return ( 1 );
        }
        completed_check_cnt += cur_read_size;
        cur_addr += cur_read_size;
    }

    return ( 0 );
}

static
int platform_get_backup_sector( uint32_t* backup_sector_start, uint32_t* backup_sector_size )
{
   *backup_sector_start = backup_sector_address;
   *backup_sector_size = erase_sector_size;

   return ( 0 );
}

static
int platform_copy_sflash_src_to_dest ( unsigned long src, unsigned long dest, unsigned int size )
{
    uint8_t read_mem_buf[PACKET_SIZE];
    uint32_t completed_check_cnt = 0;
    uint32_t cur_src_addr = src;
    uint32_t cur_dst_addr = dest;
    uint32_t cur_read_size;
    while ( completed_check_cnt < size )
    {
        if ( ( size - completed_check_cnt ) > PACKET_SIZE )
        {
            cur_read_size = PACKET_SIZE;
        }
        else
        {
            cur_read_size = size - completed_check_cnt;
        }

