pista86/CESE-6Co2018---PCSE-/Codigo uso QSPI para EMW3166/43xxx_Wi-Fi/WICED/platform/MCU/PSoC6/peripherals/spi_flash/spi_flash.c
        platform_read_memory( read_mem_buf, cur_read_size, cur_src_addr, 0 );

        if ( platform_check_for_non_ff ( read_mem_buf, cur_read_size ) )
        {
             platform_write_memory( read_mem_buf, cur_read_size, cur_dst_addr );
        }
        else
        {
             DEBUG_PRINTS_CRIT( ( "%s: No need to copy from: 0x%04lX to: 0x%04lX\r\n", __func__, cur_src_addr, cur_dst_addr ) );
        }
        completed_check_cnt += cur_read_size;
        cur_src_addr += cur_read_size;
        cur_dst_addr += cur_read_size;
    }

    return ( 0 );
}


static
int platform_sflash_erase( unsigned long device_address, unsigned int size )
{
    cy_en_smif_status_t status;
    uint8_t ext_mem_address[3] = { 0x0, 0x0, 0x0};

    platform_address_to_pdl_array( device_address, ext_mem_address );

    /* Erase */

    UNUSED_PARAMETER( size );

    status = Cy_SMIF_Memslot_CmdWriteEnable( SMIF0, smifMemConfigs[0], &smif_block_context );

    if( status!=CY_SMIF_SUCCESS )
    {
        DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_CmdWriteEnable failed\r\n" ) );
        return ( status );
    }

    status = Cy_SMIF_Memslot_CmdSectorErase( SMIF0, (cy_stc_smif_mem_config_t*)smifMemConfigs[0], ext_mem_address,&smif_block_context );

    if( status!=CY_SMIF_SUCCESS )
    {
        DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_CmdSectorErase failed: 0x%04X\r\n", status ) );
        return ( status );
    }


    /* Wait until the memory is erased */
    while( Cy_SMIF_Memslot_IsBusy( SMIF0, (cy_stc_smif_mem_config_t*)smifMemConfigs[0], &smif_block_context ) )
    {
       /* Wait until the Erase operation is completed */
    }
    return ( 0 );
}

static
int sflash_erase( const sflash_handle_t* const handle, unsigned long device_address, unsigned int size )
{
    cy_en_smif_status_t status = CY_SMIF_SUCCESS;
    uint32_t backup_sector_start, backup_sector_size, offset_in_sector;
    uint32_t save_required_flash_content = 0;
    uint32_t save_first_start_address, save_first_end_address, save_second_start_address, save_second_end_address;
    uint32_t save_first_copy_size, save_second_copy_size;

    UNUSED_PARAMETER( handle );

    DEBUG_PRINTS( ( "\r\n%s: Address: 0x%04lX, Size: %u\r\n\r\n", __func__, device_address, size ) );

    if ( sflash_need_to_erase ( device_address, size ) == 0 )
    {
         DEBUG_PRINTS_CRIT( ( "\r\n%s: Address: 0x%04lX, Size: %u, No Need to Earse!!!!!\r\n\r\n", __func__, device_address, size ) );
         return ( 0 );
    }

    DEBUG_PRINTS( ( "\r\n%s: Address: 0x%04lX, Size: %u\r\n\r\n", __func__, device_address, size ) );

    if ( ( device_address % erase_sector_size == 0 ) && ( size == erase_sector_size ) )
    {
        DEBUG_PRINTS_CRIT( ( "\r\n%s: Address: 0x%04lX, Size: %u, Only Erase - No need to save/restore other parts of flash!!!!!\r\n\r\n", __func__, device_address, size) );
    } else {
        DEBUG_PRINTS_CRIT( ( " Sector Erase With Store & Restore Needed!!\r\n" ) );
        save_required_flash_content = 1;
        save_first_start_address = ( device_address / erase_sector_size ) * erase_sector_size;
        save_first_end_address = device_address;
        save_first_copy_size = save_first_end_address - save_first_start_address;
        save_second_start_address = device_address + size;
        save_second_end_address = ( ( device_address / erase_sector_size ) + 1 ) * erase_sector_size;
        save_second_copy_size = save_second_end_address - save_second_start_address;
        DEBUG_PRINTS_CRIT( ( "\r\n%s: Address: 0x%08lX, Size: %u, Needs save/restore other parts of flash!!!!!\r\n\r\n", __func__, device_address, size ) );
        DEBUG_PRINTS_CRIT( ( "\r\n%s: Save first start Address: 0x%08lX, Save first Address End: 0x%08lX\r\n", __func__, save_first_start_address, save_first_end_address ) );
        DEBUG_PRINTS_CRIT( ( "\r\n%s: Save second start Address: 0x%08lX, Save second Address End: 0x%08lX\r\n", __func__, save_second_start_address, save_second_end_address ) );
    }

    if ( save_required_flash_content )
    {
        DEBUG_PRINTS_CRIT( ( " Sector Erase With Store & Restore Started!!\r\n" ) );

        platform_get_backup_sector( &backup_sector_start, &backup_sector_size );

        DEBUG_PRINTS_CRIT( ( " Erasing Backup Sector start: 0x%08lX,  size: 0x%08lX!!\r\n", backup_sector_start, backup_sector_size ) );

        status = platform_sflash_erase( backup_sector_start, backup_sector_size );

        DEBUG_PRINTS_CRIT( ( "\r\n%s: Backup Sector Start: 0x%08lX, Backup Sector Size: 0x%08lX\r\n", __func__, backup_sector_start, backup_sector_size ) );

        DEBUG_PRINTS_CRIT( ( "Saving Sector contents to Backup before Erase!!\r\n" ) );

        DEBUG_PRINTS_CRIT( ( "\r\n%s: First Part!! Copy from: 0x%08lX, Copy To: 0x%08lX, Size: 0x%08lX\r\n", __func__,
                        save_first_start_address, backup_sector_start, save_first_copy_size ) );

        platform_copy_sflash_src_to_dest( save_first_start_address, backup_sector_start, save_first_copy_size );

        offset_in_sector = ( save_second_start_address & mask_address_in_sector );

        DEBUG_PRINTS_CRIT( ( "\r\n%s: Second Part!! Copy from: 0x%08lX, Copy To: 0x%08lX, Size: 0x%08lX\r\n", __func__,
                     save_second_start_address, ( backup_sector_start + offset_in_sector ), save_second_copy_size ) );

        platform_copy_sflash_src_to_dest( save_second_start_address, ( backup_sector_start + offset_in_sector ),
                     save_second_copy_size );
    }

    status = platform_sflash_erase( device_address, size );

    if ( save_required_flash_content )
    {
        DEBUG_PRINTS_CRIT( ( "Restoring Sector contents from Backup after Erase!!\r\n" ) );

        DEBUG_PRINTS_CRIT( ( "\r\n%s: First Part!! Copy from: 0x%08lX, Copy To: 0x%08lX, Size: 0x%08lX\r\n", __func__,
                      backup_sector_start, save_first_start_address, save_first_copy_size ) );

