pista86/CESE-6Co2018---PCSE-/Codigo uso QSPI para EMW3166/43xxx_Wi-Fi/WICED/platform/MCU/PSoC6/peripherals/spi_flash/spi_flash.c
        platform_copy_sflash_src_to_dest( backup_sector_start, save_first_start_address, save_first_copy_size );

        DEBUG_PRINTS_CRIT( ( "\r\n%s: Second Part!! Copy from: 0x%08lX, Copy To: 0x%08lX, Size: 0x%08lX\r\n", __func__,
                     ( backup_sector_start + offset_in_sector ), save_second_start_address, save_second_copy_size ) );

        platform_copy_sflash_src_to_dest ( ( backup_sector_start + offset_in_sector ), save_second_start_address, save_second_copy_size );
        DEBUG_PRINTS_CRIT( ( " Sector Erase With Store & Restore Completed!!\r\n" ) );
    }

    return ( status );
}


int deinit_sflash( /*@out@*/ sflash_handle_t* const handle)
{
    UNUSED_PARAMETER( handle );
    return 0;
}

int init_sflash( /*@out@*/ sflash_handle_t* const handle, /*@shared@*/ void* peripheral_id, sflash_write_allowed_t write_allowed_in )
{
    cy_stc_smif_config_t smif;
    cy_en_smif_status_t status;
    GPIO_PRT_Type* port_base;

    UNUSED_PARAMETER( handle );
    UNUSED_PARAMETER( peripheral_id );
    UNUSED_PARAMETER( write_allowed_in );


    DEBUG_PRINTS( ( "Entered %s\r\n", __func__ ) );

    /* Port11 configuration */

    port_base = Cy_GPIO_PortToAddr( PSOC_SMIF_PORT );

    /* Configure all the SMIF Pins */
    Cy_GPIO_Pin_FastInit( port_base, PSOC_SMIF_SPI_SELECT0, CY_GPIO_DM_STRONG_IN_OFF, 0x1, P11_2_SMIF_SPI_SELECT0 );
    Cy_GPIO_Pin_FastInit( port_base, PSOC_SMIF_SPI_DATA3,   CY_GPIO_DM_STRONG,        0x1, P11_3_SMIF_SPI_DATA3 );
    Cy_GPIO_Pin_FastInit( port_base, PSOC_SMIF_SPI_DATA2,   CY_GPIO_DM_STRONG,        0x1, P11_4_SMIF_SPI_DATA2 );
    Cy_GPIO_Pin_FastInit( port_base, PSOC_SMIF_SPI_DATA1,   CY_GPIO_DM_STRONG,        0x1, P11_5_SMIF_SPI_DATA1 );
    Cy_GPIO_Pin_FastInit( port_base, PSOC_SMIF_SPI_DATA0,   CY_GPIO_DM_STRONG,        0x1, P11_6_SMIF_SPI_DATA0 );
    Cy_GPIO_Pin_FastInit( port_base, PSOC_SMIF_SPI_CLK,     CY_GPIO_DM_STRONG_IN_OFF, 0x1, P11_7_SMIF_SPI_CLK );

    smif.mode = CY_SMIF_NORMAL;
    smif.deselectDelay = SMIF_1_DESELECT_DELAY;     /* Just for testing */
    smif.rxClockSel = (uint32_t)CY_SMIF_SEL_INV_INTERNAL_CLK;     /* Just for testing */
    smif.blockEvent = (uint32_t)CY_SMIF_BUS_ERROR;

    status = Cy_SMIF_Init ( SMIF0, &smif, 1000, &smif_block_context );

    if ( status != CY_SMIF_SUCCESS )
    {
        DEBUG_PRINTS( ( "Cy_SMIF_Init() Failed!!, status: %d\n", status ) );
        return ( status );
    }

    Cy_SMIF_SetDataSelect ( SMIF0, CY_SMIF_SLAVE_SELECT_0, CY_SMIF_DATA_SEL0 );

    Cy_SMIF_Enable ( SMIF0, &smif_block_context );

    NVIC_EnableIRQ( smif_interrupt_IRQn );

    memory_size = smifMemConfigs[0]->deviceCfg->memSize;
    erase_sector_size= smifMemConfigs[0]->deviceCfg->eraseSize;
    mask_address_in_sector = erase_sector_size - 1;
    /* Hueristic logic below */
    if ( memory_size > SECTOR_SIZE_16_MEG )
    {
        memory_size = SECTOR_SIZE_16_MEG;
    }

    if ( ( memory_size / erase_sector_size ) > 16 )
    {
       backup_sector_address = ( ( ( memory_size / erase_sector_size )  - 4 ) * erase_sector_size );
    } else
    {
       backup_sector_address = ( ( (memory_size / erase_sector_size )  - 1 ) * erase_sector_size );
    }

    DEBUG_PRINTS( ( "Leaving %s\r\n", __func__ ) );

    return 0;
}

int sflash_get_size ( const sflash_handle_t* handle, unsigned long* size )
{
    UNUSED_PARAMETER( handle );

    *size = memory_size;
    return ( 0 );
}

int sflash_chip_erase ( const sflash_handle_t* handle )
{
    cy_en_smif_status_t status = CY_SMIF_SUCCESS;

    UNUSED_PARAMETER( handle );
    status = Cy_SMIF_Memslot_CmdWriteEnable( SMIF0, smifMemConfigs[0], &smif_block_context );

    if( status!=CY_SMIF_SUCCESS )
    {
        DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_CmdWriteEnable failed\r\n" ) );
        return ( status );
    }

    status = Cy_SMIF_Memslot_CmdChipErase( SMIF0, (cy_stc_smif_mem_config_t*)smifMemConfigs[0],
                                          &smif_block_context );

    if( status!=CY_SMIF_SUCCESS )
    {
        DEBUG_PRINTS( ( "\r\n\r\nSMIF Cy_SMIF_Memslot_CmdChipErase() failed: 0x%04X\r\n", status ) );
        return ( status );
    }

    /* Wait until the memory is erased */
    while( Cy_SMIF_Memslot_IsBusy( SMIF0, (cy_stc_smif_mem_config_t*)smifMemConfigs[0], &smif_block_context ) )
    {
       /* Wait until the Erase operation is completed */
    }
    return ( status );
}

int sflash_sector_erase ( const sflash_handle_t* handle, unsigned long device_address )
{
    int result;

    UNUSED_PARAMETER( handle );
    result =  sflash_erase( handle, device_address, 4096 );      /* Stubbing something for compilation and testing */
    return result;
}

void platform_smif_irq( void );
void platform_smif_irq( void )
{
    Cy_SMIF_Interrupt( SMIF0, &smif_block_context );

}
/*@noaccess sflash_handle_t@*/
